#### Terraform Plan 📖`success`

<details><summary>Show staging Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_password.password: Refreshing state... [id=none]
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01]
module.vm1.azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/publicIPAddresses/pip-vm1-neolutin-01]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/virtualNetworks/vnet-neolutin-01]
azurerm_availability_set.availability: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/availabilitySets/aset-neolutin-01]
azurerm_network_security_group.vault: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkSecurityGroups/nsg-neolutin-01]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/virtualNetworks/vnet-neolutin-01/subnets/internal]
module.vm1.azurerm_network_interface.internal: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-neolutin-01]
module.vm1.azurerm_network_interface.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic1-vm1-neolutin-01]
azurerm_key_vault.main_kv: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.KeyVault/vaults/kv-neolutin-01]
module.vm1.azurerm_network_interface_security_group_association.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-neolutin-01|/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkSecurityGroups/nsg-neolutin-01]
module.vm1.azurerm_linux_virtual_machine.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01]
azurerm_key_vault_key.vaultkey: Refreshing state... [id=https://kv-neolutin-01.vault.azure.net/keys/vaultkey/6d2876e377ed414986604914714c6b8e]
azurerm_key_vault_secret.simple_user_password: Refreshing state... [id=https://kv-neolutin-01.vault.azure.net/secrets/simplepassword/efc4529226b045acae70dd37e84fe058]
module.vm1.azurerm_virtual_machine_extension.installvault: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01/extensions/installvault]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm1.azurerm_linux_virtual_machine.main has been changed
  ~ resource "azurerm_linux_virtual_machine" "main" {
        id                              = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01"
        name                            = "vm1-neolutin-01"
      - public_ip_address               = "20.93.164.194" -> null
      ~ public_ip_addresses             = [
          - "20.93.164.194",
        ]
        tags                            = {
            "Terraform" = "true"
        }
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.vm1.azurerm_network_interface.internal has been changed
  ~ resource "azurerm_network_interface" "internal" {
        id                            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-neolutin-01"
      - internal_domain_name_suffix   = "zzh3oftgcdjuvnv23mphcz4xbd.ax.internal.cloudapp.net" -> null
      + mac_address                   = "00-0D-3A-27-DB-BF"
        name                          = "nic2-vm1-neolutin-01"
        tags                          = {
            "Terraform" = "true"
        }
      + virtual_machine_id            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vm1.azurerm_network_interface.main has been changed
  ~ resource "azurerm_network_interface" "main" {
        id                            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic1-vm1-neolutin-01"
      - internal_domain_name_suffix   = "zzh3oftgcdjuvnv23mphcz4xbd.ax.internal.cloudapp.net" -> null
      + mac_address                   = "00-0D-3A-27-D4-6A"
        name                          = "nic1-vm1-neolutin-01"
        tags                          = {
            "Terraform" = "true"
        }
      + virtual_machine_id            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vm1.azurerm_public_ip.pip has been changed
  ~ resource "azurerm_public_ip" "pip" {
        id                      = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/publicIPAddresses/pip-vm1-neolutin-01"
      + ip_tags                 = {}
        name                    = "pip-vm1-neolutin-01"
        tags                    = {
            "Terraform" = "true"
        }
        # (11 unchanged attributes hidden)
    }
  # azurerm_subnet.internal has been changed
  ~ resource "azurerm_subnet" "internal" {
        id                                             = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/virtualNetworks/vnet-neolutin-01/subnets/internal"
        name                                           = "internal"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (6 unchanged attributes hidden)
    }
  # azurerm_virtual_network.main has been changed
  ~ resource "azurerm_virtual_network" "main" {
        id                    = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/virtualNetworks/vnet-neolutin-01"
        name                  = "vnet-neolutin-01"
      ~ subnet                = [
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/virtualNetworks/vnet-neolutin-01/subnets/internal"
              + name           = "internal"
              + security_group = ""
            },
        ]
        tags                  = {
            "Terraform" = "true"
        }
        # (6 unchanged attributes hidden)
    }
  # azurerm_key_vault_secret.simple_user_password has been changed
  ~ resource "azurerm_key_vault_secret" "simple_user_password" {
        id             = "https://kv-neolutin-01.vault.azure.net/secrets/simplepassword/efc4529226b045acae70dd37e84fe058"
        name           = "simplepassword"
      + tags           = {}
        # (5 unchanged attributes hidden)
    }
  # azurerm_key_vault.main_kv has been changed
  ~ resource "azurerm_key_vault" "main_kv" {
        id                              = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.KeyVault/vaults/kv-neolutin-01"
        name                            = "kv-neolutin-01"
        tags                            = {
            "Terraform" = "true"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          + ip_rules                   = []
          + virtual_network_subnet_ids = []
            # (2 unchanged attributes hidden)
        }
    }
  # azurerm_key_vault_key.vaultkey has been changed
  ~ resource "azurerm_key_vault_key" "vaultkey" {
        id                 = "https://kv-neolutin-01.vault.azure.net/keys/vaultkey/6d2876e377ed414986604914714c6b8e"
        name               = "vaultkey"
      + tags               = {}
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.ansible_app will be created
  + resource "azuread_application" "ansible_app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "ansible-staging"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "6b678753-daf0-418c-a833-0806443a23be",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + template_id                 = (known after apply)
    }

  # azuread_application_password.ansible_app_pass will be created
  + resource "azuread_application_password" "ansible_app_pass" {
      + application_object_id = (known after apply)
      + display_name          = "terraform-staging"
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # azuread_service_principal.ansible_sp will be created
  + resource "azuread_service_principal" "ansible_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # azurerm_key_vault.main_kv must be replaced
-/+ resource "azurerm_key_vault" "main_kv" {
      ~ access_policy                   = [
          ~ {
              ~ application_id          = "" -> null
                # (6 unchanged elements hidden)
            },
          ~ {
              ~ application_id          = "" -> null
              ~ object_id               = "39580679-20c8-4904-94f6-d71ebc75a888" -> (known after apply)
                # (5 unchanged elements hidden)
            },
        ]
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.KeyVault/vaults/kv-neolutin-01" -> (known after apply)
      ~ name                            = "kv-neolutin-01" -> "kv-staging-neolutin-01" # forces replacement
      ~ soft_delete_enabled             = true -> (known after apply)
        tags                            = {
            "Terraform" = "true"
        }
      ~ vault_uri                       = "https://kv-neolutin-01.vault.azure.net/" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_key_vault_key.vaultkey must be replaced
-/+ resource "azurerm_key_vault_key" "vaultkey" {
      + curve              = (known after apply)
      ~ e                  = "AQAB" -> (known after apply)
      ~ id                 = "https://kv-neolutin-01.vault.azure.net/keys/vaultkey/6d2876e377ed414986604914714c6b8e" -> (known after apply)
      ~ key_vault_id       = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.KeyVault/vaults/kv-neolutin-01" -> (known after apply) # forces replacement
      ~ n                  = "rmDpACOSdE-nZqCqTTwUm2FMrSr-avbgmwoFCXeYMRHQHTR0tNeLbIVWRPY_xKxACBWZ7z1mA8WiHmHbVoKejnhIZs77YsKVR3C2NPJ9KXN_aVD62jDZtnjVVcnOmswNcdjUz8U3Ny11Ni7VZMAE-I3T4GICUIdg55kRiN5GMIfjOkgDVZt81QsTVckLlL3zVITatMZH5Y3qkcek1l2Ui7096a9DjrBYk-yqC20Rb8sgOOZ7CWVn7UaGoPORwqskz4kDQoev7CIQELUG0di5DNGpq1SOPUksTCguBID_GyrIA6IU22EcZLZSXNhmmBFT-Yo8tYIpDsOolNIn7ZCXCQ" -> (known after apply)
        name               = "vaultkey"
      ~ public_key_openssh = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCuYOkAI5J0T6dmoKpNPBSbYUytKv5q9uCbCgUJd5gxEdAdNHS014tshVZE9j/ErEAIFZnvPWYDxaIeYdtWgp6OeEhmzvtiwpVHcLY08n0pc39pUPraMNm2eNVVyc6azA1x2NTPxTc3LXU2LtVkwAT4jdPgYgJQh2DnmRGI3kYwh+M6SANVm3zVCxNVyQuUvfNUhNq0xkfljeqRx6TWXZSLvT3pr0OOsFiT7KoLbRFvyyA45nsJZWftRoag85HCqyTPiQNCh6/sIhAQtQbR2LkM0amrVI49SSxMKC4EgP8bKsgDohTbYRxktlJc2GaYEVP5ijy1gikOw6iU0iftkJcJ
        EOT -> (known after apply)
      ~ public_key_pem     = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEArmDpACOSdE+nZqCqTTwU
            m2FMrSr+avbgmwoFCXeYMRHQHTR0tNeLbIVWRPY/xKxACBWZ7z1mA8WiHmHbVoKe
            jnhIZs77YsKVR3C2NPJ9KXN/aVD62jDZtnjVVcnOmswNcdjUz8U3Ny11Ni7VZMAE
            +I3T4GICUIdg55kRiN5GMIfjOkgDVZt81QsTVckLlL3zVITatMZH5Y3qkcek1l2U
            i7096a9DjrBYk+yqC20Rb8sgOOZ7CWVn7UaGoPORwqskz4kDQoev7CIQELUG0di5
            DNGpq1SOPUksTCguBID/GyrIA6IU22EcZLZSXNhmmBFT+Yo8tYIpDsOolNIn7ZCX
            CQIDAQAB
            -----END PUBLIC KEY-----
        EOT -> (known after apply)
      - tags               = {} -> null
      ~ version            = "6d2876e377ed414986604914714c6b8e" -> (known after apply)
      ~ versionless_id     = "https://kv-neolutin-01.vault.azure.net/keys/vaultkey" -> (known after apply)
      + x                  = (known after apply)
      + y                  = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.simple_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "simple_user_password" {
      - content_type   = "" -> null
      ~ id             = "https://kv-neolutin-01.vault.azure.net/secrets/simplepassword/efc4529226b045acae70dd37e84fe058" -> (known after apply)
      ~ key_vault_id   = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.KeyVault/vaults/kv-neolutin-01" -> (known after apply) # forces replacement
        name           = "simplepassword"
      - tags           = {} -> null
      ~ version        = "efc4529226b045acae70dd37e84fe058" -> (known after apply)
      ~ versionless_id = "https://kv-neolutin-01.vault.azure.net/secrets/simplepassword" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.ansible_ra will be created
  + resource "azurerm_role_assignment" "ansible_ra" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 7
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.vm1.azurerm_linux_virtual_machine.main must be replaced
-/+ resource "azurerm_linux_virtual_machine" "main" {
      ~ availability_set_id             = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/availabilitySets/ASET-NEOLUTIN-01" -> "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/availabilitySets/aset-neolutin-01"
      ~ computer_name                   = "vm1-neolutin-01" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01" -> (known after apply)
      ~ name                            = "vm1-neolutin-01" -> "vm1-staging-neolutin-01" # forces replacement
      ~ network_interface_ids           = [
          - "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic1-vm1-neolutin-01",
          - "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-neolutin-01",
        ] -> (known after apply)
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
          - "10.0.2.5",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
        tags                            = {
            "Terraform" = "true"
        }
      ~ virtual_machine_id              = "8b682808-e881-4187-9e50-8b314ff8d7bb" -> (known after apply)
      + zone                            = (known after apply)
        # (11 unchanged attributes hidden)


      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "vm1-neolutin-01_OsDisk_1_db8c4abd567c4729b20a4d80800ba87a" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.vm1.azurerm_network_interface.internal must be replaced
-/+ resource "azurerm_network_interface" "internal" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-neolutin-01" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      ~ mac_address                   = "00-0D-3A-27-DB-BF" -> (known after apply)
      ~ name                          = "nic2-vm1-neolutin-01" -> "nic2-vm1-staging-neolutin-01" # forces replacement
      ~ private_ip_address            = "10.0.2.5" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.0.2.5",
        ] -> (known after apply)
        tags                          = {
            "Terraform" = "true"
        }
      ~ virtual_machine_id            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "internal"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.0.2.5" -> (known after apply)
          ~ private_ip_address_allocation                      = "Dynamic" -> "dynamic"
            # (2 unchanged attributes hidden)
        }
    }

  # module.vm1.azurerm_network_interface.main must be replaced
-/+ resource "azurerm_network_interface" "main" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic1-vm1-neolutin-01" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      ~ mac_address                   = "00-0D-3A-27-D4-6A" -> (known after apply)
      ~ name                          = "nic1-vm1-neolutin-01" -> "nic1-vm1-staging-neolutin-01" # forces replacement
      ~ private_ip_address            = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.0.2.4",
        ] -> (known after apply)
        tags                          = {
            "Terraform" = "true"
        }
      ~ virtual_machine_id            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "primary"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.0.2.4" -> (known after apply)
          ~ private_ip_address_allocation                      = "Dynamic" -> "dynamic"
          ~ public_ip_address_id                               = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/publicIPAddresses/pip-vm1-neolutin-01" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.vm1.azurerm_network_interface_security_group_association.main must be replaced
-/+ resource "azurerm_network_interface_security_group_association" "main" {
      ~ id                        = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-neolutin-01|/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkSecurityGroups/nsg-neolutin-01" -> (known after apply)
      ~ network_interface_id      = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-neolutin-01" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vm1.azurerm_public_ip.pip must be replaced
-/+ resource "azurerm_public_ip" "pip" {
      ~ availability_zone       = "No-Zone" -> (known after apply)
      ~ domain_name_label       = "vm1-neolutin-01" -> "vm1-staging-neolutin-01"
      ~ fqdn                    = "vm1-neolutin-01.westeurope.cloudapp.azure.com" -> (known after apply)
      ~ id                      = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/publicIPAddresses/pip-vm1-neolutin-01" -> (known after apply)
      + ip_address              = (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "pip-vm1-neolutin-01" -> "pip-vm1-staging-neolutin-01" # forces replacement
        tags                    = {
            "Terraform" = "true"
        }
      ~ zones                   = [] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm1.azurerm_virtual_machine_extension.installvault must be replaced
-/+ resource "azurerm_virtual_machine_extension" "installvault" {
      - auto_upgrade_minor_version = false -> null
      - automatic_upgrade_enabled  = false -> null
      ~ id                         = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01/extensions/installvault" -> (known after apply)
        name                       = "installvault"
      ~ settings                   = jsonencode( # whitespace changes
            {
                commandToExecute = "curl -fsSL https://apt.releases.hashicorp.com/gpg | sudo apt-key add - && sudo apt-add-repository \"deb [arch=amd64] https://apt.releases.hashicorp.com $(lsb_release -cs) main\" && sudo apt-get update && sudo apt-get install -y vault jq"
            }
        )
        tags                       = {
            "Terraform" = "true"
        }
      ~ virtual_machine_id         = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-neolutin-01" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 14 to add, 0 to change, 9 to destroy.

Changes to Outputs:
  + ansible_app_clientid = (known after apply)
  + ansible_app_pass     = (sensitive value)
  ~ vm1_fqdn             = "vm1-neolutin-01.westeurope.cloudapp.azure.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @neolutin, Action: `pull_request`*